In [2]:
word = 'Layla'
sent = 'Layla is cute'
print(word[0])
print(sent[0])

L
L

In [3]:
sent[0:5]

'Layla'

In [6]:
text = 'the layla is cute beacause she was cute'
text[:]

'the layla is cute beacause she was cute'

In [7]:
text[0:]

'the layla is cute beacause she was cute'

In [8]:
text

'the layla is cute beacause she was cute'

In [9]:
text[0:len(text)]

'the layla is cute beacause she was cute'

In [10]:
text[-7:-3]

'as c'

In [17]:
text[-4:-1]

'cut'

In [18]:
text[-3:]

'ute'

In [19]:
text[:-3]

'the layla is cute beacause she was c'

In [22]:
text[-4:-1]

'cut'

In [23]:
text[-3:]

'ute'

In [24]:
word

'Layla'

In [25]:
word[0:3]

'Lay'

In [27]:
word[:3]

'Lay'

In [28]:
sent[4:]

'a is cute'

In [29]:
sent[:]

'Layla is cute'

In [31]:
sent[::2]

'Lyai ue'

In [33]:
a = 'Name : layla'
b = 'StudentID : 20230000'
c = 'Hobby : Study'
d = 'Comment : Cute'
" ".join([a, b, c, d])

'Name : layla StudentID : 20230000 Hobby : Study Comment : Cute'

In [36]:
text = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconuts!
Queen Raiden: What?
Guard: You've Got ... coconuts[s] and you're banagin em together
"""
print(text.splitlines()[::2])

['Guard: What? Ridden en a horse?', "Guard: You're using coconuts!", "Guard: You've Got ... coconuts[s] and you're banagin em together"]

In [38]:
str(text.splitlines()[::2]).replace('Guard', 'Yae Miko')

'[\'Yae Miko: What? Ridden en a horse?\', "Yae Miko: You\'re using coconuts!", "Yae Miko: You\'ve Got ... coconuts[s] and you\'re banagin em together"]'

In [40]:
text = "{} is cute!".format("layla")
text

'layla is cute!'

In [41]:
text = """
{name1}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {name2}는 {name1}을 괴롭히는 원인 중 하나입니다.
"""
text.format(name1="레일라", name2="나히다")

'\n레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다는 레일라을 괴롭히는 원인 중 하나입니다.\n'

In [43]:
text = """
{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}는 {0}을 괴롭히는 원인 중 하나입니다.
"""
text.format("레일라", "나히다")

'\n레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다는 레일라을 괴롭히는 원인 중 하나입니다.\n'

In [45]:
"나히다는 {a}살 이상이다.".format(a=500)

'나히다는 500살 이상이다.'

In [46]:
"나는 IPAT 자격시험에서 {:,}등을 하고 싶다.".format(1)

'나는 IPAT 자격시험에서 1등을 하고 싶다.'

In [48]:
"나는, 나의 통장 잔고가 {:,}원이 되면 좋겠다".format(999999999999999)

'나는, 나의 통장 잔고가 999,999,999,999,999원이 되면 좋겠다'

In [53]:
"i remember{0:.3} or {0:.3%} of thease days".format(7/67890)
# 주의~ 여기에는 0이 필수로 들어가야 해요~

'i remember0.000103 or 0.010% of thease days'

In [54]:
'My login id is {0:06d}'.format(12)

'My login id is 000012'

In [55]:
'My id code is {0:08d}'.format(12881)

'My id code is 00012881'

In [57]:
text = 'my love number is %d' % 7
text

'my love number is 7'

In [59]:
text = '%s is very cute, but her sleep time is %0.2f' % ('layla', 1.1631212)
text

'layla is very cute, but her sleep time is 1.16'

In [60]:
f"{'layla!'} 생일 축하해!"

'layla! 생일 축하해!'

In [62]:
import re
ax = re.match(pattern='\d{10}', string='1234567890')
ax

In [63]:
ax.group()

'1234567890'

In [64]:
ax.start()

0

In [65]:
ax.end()

10

In [66]:
if(bool(ax)):
    print("match")
else:
    print("mis match")

match

In [67]:
print(ax.start())
print(ax.end())
print(ax.span())
print(ax.group())

0
10
(0, 10)
1234567890

In [68]:
a = re.match(pattern='\d{3}\s\d{4}\s\d{4}', string='123 4567 8901')

In [69]:
a

In [70]:
b = re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string='(123) 456-7890')
b

In [71]:
c = re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string='+1 (123) 456-7890')

In [72]:
c

In [73]:
cx = re.compile('\D{9}\:\d{4}')
cx.match('Localhost:8888')

In [74]:
def my_exp(x):
    return x ** 2

def sel_my_exp(x, n):
    return x ** n

In [76]:
import pandas as pd

In [77]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})
df

    a   b
0  10  20
1  20  30
2  30  40

In [79]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [80]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [82]:
df['a'].apply(sel_my_exp, n=10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [83]:
printme = lambda x : print(x)

In [84]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [86]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [85]:
df.apply(printme, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [90]:
def siginia(data, types):
    sum = 0
    for i in data:
        sum += i
    if(types == 1):
        return sum / data.shape[0]
    else:
        return sum / data.shape[1]
df.apply(siginia, types=1, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [91]:
def siginia(data, types):
    sum = 0
    for i in data:
        sum += i
    if(types == 0):
        return sum / data.shape[0]
    else:
        return sum / data.shape[1]
df.apply(siginia, types=0, axis=0)

a    20.0
b    30.0
dtype: float64

In [92]:
import seaborn as sns

In [93]:
df = sns.load_dataset("titanic")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [95]:
def getstrict(data):
    return pd.isnull(data).sum()

df.apply(getstrict)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [96]:
df.apply(getstrict, axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [99]:
def layla(data):
    x = pd.isnull(data).sum()
    return x / len(data)

df.apply(layla)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [98]:
def layla(data):
    x = pd.isnull(data).sum()
    return x / data.size

df.apply(layla)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [100]:
def layla(data):
    x = pd.isnull(data).sum()
    return (x / data.size) * 100

df.apply(layla)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [103]:
def outbreak(data):
    return 1 - ((pd.isnull(data).sum()) / len(data))

df.apply(outbreak)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [104]:
def outbreak(data):
    return 1 - ((pd.isnull(data).sum()) / data.size)

df.apply(outbreak)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [105]:
def outbreak(data):
    return (1 - ((pd.isnull(data).sum()) / data.size)) * 100

df.apply(outbreak)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [108]:
def found_nan(data):
    return pd.isnull(data).sum()

df['missing'] = df.apply(found_nan, axis=1)

In [109]:
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2

In [111]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
259,1,2,female,50.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,2
463,0,2,male,48.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
780,1,3,female,13.0,0,0,7.2292,C,Third,child,False,NaN,Cherbourg,yes,True,2
756,0,3,male,28.0,0,0,7.7958,S,Third,man,True,NaN,Southampton,no,True,2
607,1,1,male,27.0,0,0,30.5000,S,First,man,True,NaN,Southampton,yes,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
830,1,3,female,15.0,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,yes,False,2
739,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,3
99,0,2,male,34.0,1,0,26.0000,S,Second,man,True,NaN,Southampton,no,False,2
533,1,3,female,NaN,0,2,22.3583,C,Third,woman,False,NaN,Cherbourg,yes,False,3
159,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False,3

In [112]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [113]:
df.groupby("year")['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [114]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [115]:
y_1952 = df[df['year'] == 1952]['lifeExp'].mean()
y_1957 = df[df['year'] == 1957]['lifeExp'].mean()
y_1962 = df[df['year'] == 1962]['lifeExp'].mean()
y_2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [119]:
xd = pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    '' : [y_1952, y_1957, y_1962, y_2007]
})
print(xd)

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [122]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [127]:
def getfunction(data):
    sum = 0
    for i in data:
        sum += i
    return sum / len(data)

df.groupby("year")['lifeExp'].agg(getfunction)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [128]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64